# üê® Intermediate Data Science WEEK4   
## Pandas Cheat Sheet

In [46]:
pd.pivot?

In [49]:
 df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
...                            'two'],
...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
...                    'baz': [1, 2, 3, 4, 5, 6],
...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [50]:
df2 = df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [51]:
pd.melt(df2)

   variable  value
0         a      7
1         a      9
2         a      4
3         a      2
4         b     10
5         b     12
6         b     14
7         b      9
8         c     10
9         c     11
10        c     99
11        c     55

### tidy data   
Tidy data complements = vectorized

`pd.melt` Ïª¨Îüº Í∞íÏùÑ rowÎ°ú ÏòÆÍ∏∏ Îïå ÎÖπÏù∏Îã§~   
`pd.pivot` row->column

### Syntax - creating DF

In [12]:
import pandas as pd

df = pd.DataFrame({"a" : [4,5,6], "b" : [7,8,9], "c" : [10,11,12]}, index = [1,2,3])
#ÎîïÏÖîÎÑàÎ¶¨ ÌòïÌÉú
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### Reshaping Data

In [13]:
df.loc[3,"a"]

6

In [3]:
pd.melt(df)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [4]:
df2 = pd.DataFrame({"a" : [7,9,4,2], "b" : [10,12,14,9], "c" : [10,11,99,55]}, index = [1,2,3,4])

In [5]:
pd.concat([df,df2])

   a   b   c
1  4   7  10
2  5   8  11
3  6   9  12
1  7  10  10
2  9  12  11
3  4  14  99
4  2   9  55

In [6]:
pd.concat([df,df2], axis=1)

     a    b     c  a   b   c
1  4.0  7.0  10.0  7  10  10
2  5.0  8.0  11.0  9  12  11
3  6.0  9.0  12.0  4  14  99
4  NaN  NaN   NaN  2   9  55

In [7]:
df.pivot(columns='a')

     b               c
a    4    5    6     4     5     6
1  7.0  NaN  NaN  10.0   NaN   NaN
2  NaN  8.0  NaN   NaN  11.0   NaN
3  NaN  NaN  9.0   NaN   NaN  12.0

In [8]:
df = pd.read_csv('C:\\Users\\Owner\\Documents\\GitHub\\parks.csv')
df.head()

  Park Code               Park Name State   Acres  Latitude  Longitude
0      ACAD    Acadia National Park    ME   47390     44.35     -68.21
1      ARCH    Arches National Park    UT   76519     38.68    -109.57
2      BADL  Badlands National Park    SD  242756     43.75    -102.50
3      BIBE  Big Bend National Park    TX  801163     29.25    -103.25
4      BISC  Biscayne National Park    FL  172924     25.65     -80.08

In [9]:
pd.melt(df)

      variable   value
0    Park Code    ACAD
1    Park Code    ARCH
2    Park Code    BADL
3    Park Code    BIBE
4    Park Code    BISC
..         ...     ...
331  Longitude -103.48
332  Longitude    -142
333  Longitude  -110.5
334  Longitude  -119.5
335  Longitude -113.05

[336 rows x 2 columns]

In [11]:
df.sort_values('Acres', ascending = False)[:5]

,Park Code,Park Name,State,Acres,Latitude,Longitude
52,WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.00,-142.00
18,GAAR,Gates Of The Arctic National Park and Preserve,AK,7523898,67.78,-153.30
15,DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
32,KATM,Katmai National Park and Preserve,AK,3674530,58.50,-155.00
14,DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50

In [24]:
df.sort_index()[:5]

  Park Code               Park Name State   Acres  Latitude  Longitude
0      ACAD    Acadia National Park    ME   47390     44.35     -68.21
1      ARCH    Arches National Park    UT   76519     38.68    -109.57
2      BADL  Badlands National Park    SD  242756     43.75    -102.50
3      BIBE  Big Bend National Park    TX  801163     29.25    -103.25
4      BISC  Biscayne National Park    FL  172924     25.65     -80.08

In [15]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

* `pd.concat()`

In [52]:
pd.concat?

In [53]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])

In [54]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [55]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [56]:
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [57]:
pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [59]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])

In [60]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [61]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [62]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [63]:
pd.concat([df1, df3], join="inner") # Í≤πÏπòÎäî Í≤É - Ïª¨ÎüºÎ™Ö Îã§Î•º Îïå

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

### Subset observations ÌäπÏ†ïÌñâ Í∞ÄÏ†∏Ïò§Í∏∞

In [16]:
df[df.a > 4]

   a  b   c
2  5  8  11
3  6  9  12

In [17]:
df[df['c'] > 4]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [27]:
df = pd.DataFrame(
[[4, 7, 10],
[4, 7, 10],
[5, 9, 12]],
index=[1, 2, 3],
columns=['b', 'b', 'c'])

df

   b  b   c
1  4  7  10
2  4  7  10
3  5  9  12

In [28]:
df = df.drop_duplicates()

In [29]:
df

   b  b   c
1  4  7  10
3  5  9  12

Ï§ëÎ≥µÎêú Ïó¥ÏùÑ Ï†úÍ±∞

In [30]:
df.c.isin([7])

1    False
3    False
Name: c, dtype: bool

In [31]:
df['c'].isin([10])

1     True
3    False
Name: c, dtype: bool

In [32]:
pd.isnull(df)

       b      b      c
1  False  False  False
3  False  False  False

* df.column.isin(values)   
* pd.isnull(obj) - is NaN   
* pd.notnull(obj) - is not Nan

In [33]:
df = pd.DataFrame(
[[4, 7, 10],
[4, 7, 10],
[5, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

df

   a  b   c
1  4  7  10
2  4  7  10
3  5  9  12

In [36]:
df.loc[df['a'] > 2, ['a','c']]

   a   c
1  4  10
2  4  10
3  5  12

### Pandas Make New Columns

In [39]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]},
...                   index=['Portland', 'Berkeley'])
df

          temp_c
Portland    17.0
Berkeley    25.0

In [38]:
df.assign?

In [40]:
df.assign(temp_f=lambda x: x.temp_c * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

* qcut : nÏùò Í∞úÏàòÎßåÌÅº Îπà Ïª¨ÎüºÏùÑ ÎßåÎì§Ïñ¥Ï£ºÎùº   
`pd.qcut(df.col, n, labels=False)`
* Ïà´ÏûêÌòï -> categorical

In [42]:
pd.qcut?

In [44]:
pd.qcut(df.temp_c, 3, labels=["good", "medium", "bad"])

Portland    good
Berkeley     bad
Name: temp_c, dtype: category
Categories (3, object): [good < medium < bad]

In [45]:
df.max(axis=1)

Portland    17.0
Berkeley    25.0
dtype: float64

* clip(lower=-10,upper=10) - ÏûÑÍ≥ÑÏπòÎ°ú Î≥ÄÌôò